Revit 2015 API
CurveLoop.CreateViaThicken Method (CurveLoop, Double, XYZ)
 Creates a new closed curve loop by thickening the input open curve loop with respect to a given plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public static CurveLoop CreateViaThicken(
	CurveLoop curveLoop,
	double thickness,
	XYZ normal
)
Visual Basic
Public Shared Function CreateViaThicken ( _
	curveLoop As CurveLoop, _
	thickness As Double, _
	normal As XYZ _
) As CurveLoop
Visual C++
public:
static CurveLoop^ CreateViaThicken(
	CurveLoop^ curveLoop,
	double thickness,
	XYZ^ normal
)
Parameters
curveLoop
Type: Autodesk.Revit.DB.CurveLoop
 The input curve.
thickness
Type: System.Double
 The distance between the offset curves created on either side of the input curve.
normal
Type: Autodesk.Revit.DB.XYZ
 The normal vector to the plane used for thickening.
Return Value
 The new curve loop.
Remarks
 The new loop will be created via offsets of the input curve loop (in the plane of the normal vector) with the endpoints connected with lines.The original curve loop will be at the center of the new loop.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  the curve loop is not marked as open.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for thickness must be greater than 0 and no more than 30000 feet.
Autodesk.Revit.Exceptions.InvalidOperationException |  Throws if the input curve could not be thickened.
See Also
CurveLoop Class
CreateViaThicken Overload
Autodesk.Revit.DB Namespace